app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Sherry"], ["last_name", "Cho"], ["created_at", "2017-05-22 13:50:20.629465"], ["updated_at", "2017-05-22 13:50:20.629465"]]
---
  def create
    @student = Student.create(post_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-05-22 14:28:22.484585"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(post_params)